## ----------------------------------------
##  Brewfile
## ----------------------------------------
tap "fairwindsops/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
cask_args appdir: "/Applications"

## ========== Base ==========
brew "act" # run GitHub Actions locally
brew "age" # a simple, modern and secure encryption tool
brew "asdf" # version manager
brew "awscli"
brew "bat" # alternative cat
brew "btop" # top/htop alternative
brew "chezmoi"
brew "circleci"
brew "clamav"
brew "coreutils"
brew "direnv" # load/unload environment variables based on $PWD
brew "dust" # disk space checker
brew "exa" # alternative ls
brew "fd" # alternative find
brew "ffmpeg"
brew "fzf" # fuzzy finder
brew "gcc"
brew "gh" # github cli tool
brew "ghq" # repository manager
brew "git-delta" # syntax-highlighting pager for git, diff, and grep output
brew "git-now" # git commit helper
brew "git-secrets"
brew "git"
brew "gnu-sed"
brew "gnutls"
brew "grep"
brew "hadolint" # Docker bestpractice linter
brew "htmlq" # like jq, but for HTML.
brew "httpie" # alternative curl
brew "hugo"
brew "hurl" # http client https://hurl.dev/
brew "jq"
brew "libfido2"
brew "libxml2", link: true
brew "make"
brew "mas" # mac app store cli
brew "nkf"
brew "peco" # interactive filtering tool
brew "pre-commit"
brew "python-yq"
brew "rename"
brew "ripgrep"
brew "sd" # alternative sed
brew "shellcheck"
brew "shfmt" # formatter for shell script
brew "tig"
brew "wget"
brew "z" # jump around
brew "zellij" # terminal multiplexer

## ========== Shell ==========
brew "fish"
brew "zsh"
brew "zsh-completions"

## ========== Fonts ==========
tap  "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-hack-nerd-font"

## ========== Language & Databases ==========
brew "deno"
brew "gcc"
brew "go"
brew "mysql-client"
brew "mysql"
brew "node"
brew "postgresql"
brew "rustup-init"
brew "rustup"
brew "sqlite"

## ========== Development ==========
brew "fairwindsops/tap/pluto" # kubernetes resource analyzer
brew "infracost" # cost estimator for terraform
brew "kind" # kubernetes in docker
brew "krew" # kubectl plugin manager
brew "kubeconform" # validate Kubernetes YAML files
brew "kubergrunt"
brew "kubernetes-cli"
brew "percona-toolkit"
brew "pipx" # python package manager
brew "stern" # tail multiple pods & containers
brew "tfenv"

tap "reviewdog/tap"
brew "reviewdog/tap/reviewdog"

tap "robscott/tap" # kube-capacity
brew "robscott/tap/kube-capacity"

## ========== Applications ==========
# cask "elecom-mouse-assistant"
cask "1password-cli"
cask "1password"
cask "appcleaner"
cask "arctype"
cask "authy"
cask "amethyst"
cask "dash"
cask "discord"
cask "docker"
cask "fig"
cask "fork"
cask "gather"
cask "google-chrome"
cask "google-japanese-ime"
cask "hiddenbar"
cask "hyperswitch"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "kindle"
cask "massCode"
cask "notion"
cask "raycast"
cask "rectangle"
cask "skitch"
cask "slack"
cask "the-unarchiver"
cask "ticktick"
cask "todoist"
cask "Tweeten"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "warp"

mas "DayOne", id: 1055511498
mas "Display Menu", id: 549083868
mas "Flow", id: 1423210932
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
