## ----------------------------------------
##  Brewfile
## ----------------------------------------
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
cask_args appdir: "/Applications"

## ========== Base ==========
brew "jq"
brew "fd"
brew "gh"
brew "sd"
brew "k6"
brew "act"
brew "bat"
brew "exa"
brew "fzf"
brew "ghq"
brew "git"
brew 'mas'
brew "nkf"
brew "asdf"
brew "dust"
brew "grep"
brew "grex"
brew "tmux"
brew "htmlq"
brew "shfmt"
brew "neovim"
brew "ffmpeg"
brew "httpie"
brew "rename"
brew "git-lfs"
brew "gnu-sed"
brew "ripgrep"
brew "kompose"
brew "lefthook"
brew "minikube"
brew "skaffold"
brew "coreutils"
brew "git-delta"
brew "shellcheck"
brew "youtube-dl"
brew "imagemagick"
brew "git-secrets"
tap "chevdor/tera-cli", "https://github.com/chevdor/tera-cli"
brew "chevdor/tera-cli/tera"

## ========== Shell ==========
brew "zsh"
brew "zsh-completions"

## ========== Fonts ==========
tap  "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-hack-nerd-font"

## ========== Language & Databases ==========
brew "gcc"
brew "gdb"
brew "php"
brew "node"
brew "mysql"
brew "golang"
brew "python"
brew "sqlite"
brew "rustup"
brew "sccache"
brew "postgres"
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk11"

## ========== Applications ==========
cask "zoom"
cask "slack"
cask "alfred"
cask "docker"
cask "kindle"
cask "iterm2"
cask "skitch"
cask "postman"
cask "gpg-suite"
cask "tableplus"
cask "rectangle"
cask "appcleaner"
cask "sequel-ace"
cask "google-chrome"
# cask "android-studio"
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "db-browser-for-sqlite"
# mas  "Xcode", id: 497799835
