## ----------------------------------------
##	Brewfile
## ----------------------------------------
cask_args appdir: "/Applications"

## ========== Base ==========
brew "fd"
brew "fx"
brew "jq"
brew "bat"
brew "exa"
brew "fzf"
brew "ghq"
brew "git"
brew "hub"
brew 'mas'
brew "nkf"
brew "tig"
brew "vim"
brew "grep"
brew "tmux"
brew "mycli"
brew "anyenv"
brew "neovim"
brew "ffmpeg"
brew "git-lfs"
brew "gnu-sed"
brew "ripgrep"
brew "neofetch"
brew "git-delta"
brew "hyperfine"
brew "brightness"
brew "shellcheck"
brew "chromedriver"
tap  "cjbassi/ytop"
brew "ytop"
brew "extrawurst/tap/gitui"

## ========== Shell ==========
brew "zsh"
brew "zsh-completions"

## ========== Language ==========
brew "go"
brew "gcc"
brew "perl"
brew "node"
brew "ruby"
brew "cmake"
brew "cpanm"
brew "python"
brew "rustup"

## ========== Database ==========
brew "mysql"
brew "redis"
tap  "mongodb/brew"
brew "mongodb-community"

## ========== Fonts ==========
tap  "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fontawesome"

## ========== Applications ==========
cask "local"
cask "slack"
cask "alfred"
cask "docker"
cask "iterm2"
cask "kindle"
cask "notion"
cask "skitch"
cask "zoomus"
cask "discord"
cask "postman"
cask "transmit"
cask "gpg-suite"
cask "rectangle"
cask "wireshark"
cask "hiddenbar"
cask "ubersicht"
cask "appcleaner"
cask "burp-suite"
cask "virtualbox"
cask "sequel-pro"
cask "tor-browser"
cask "google-chrome"
cask "android-studio"
cask "mongodb-compass"
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "adobe-creative-cloud"
mas  "LINE", id: 539883307
mas  "Xcode", id: 497799835
mas  "Gifski", id: 1351639930
mas  "LimeChat", id: 414030210
