## ----------------------------------------
##  Brewfile
## ----------------------------------------
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
cask_args appdir: "/Applications"

## ========== Base ==========
brew "act" # run GitHub Actions locally
brew "age"
brew "asdf" # version manager
brew "awscli"
brew "bat" # alternative cat
brew "chezmoi"
brew "circleci"
brew "coreutils"
brew "direnv"
brew "dust" # disk space checker
brew "exa" # alternative ls
brew "fd" # alternative find
brew "ffmpeg"
brew "fzf"
brew "gh" # github cli tool
brew "ghq" # repository manager
brew "git-delta" # syntax-highlighting pager for git, diff, and grep output
brew "git-secrets"
brew "git"
brew "gnu-sed"
brew "grep"
brew "htmlq" # like jq, but for HTML.
brew "httpie" 
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "mas"
brew "nkf"
brew "peco"
brew "rename"
brew "ripgrep"
brew "sd" # alternative sed
brew "shellcheck"
brew "shfmt" # formatter for shell script
brew "tig"
brew "wget"
brew "z"

## ========== Shell ==========
brew "fish"
brew "zsh"
brew "zsh-completions"

## ========== Fonts ==========
tap  "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-hack-nerd-font"

## ========== Language & Databases ==========
brew "deno"
brew "gcc"
brew "go"
brew "mysql"
brew "node"
brew "postgresql"
brew "rustup"
brew "sqlite"

## ========== Applications ==========
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "arctype"
cask "authy"
cask "dash"
cask "discord"
cask "docker"
# cask "elecom-mouse-assistant"
cask "fig"
cask "fork"
cask "gather"
cask "google-chrome"
cask "google-japanese-ime"
cask "hiddenbar"
cask "hyperswitch"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "kindle"
cask "notion"
cask "raycast"
cask "rectangle"
cask "skitch"
cask "slack"
cask "the-unarchiver"
cask "ticktick"
cask "todoist"
cask "Tweeten"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "DayOne", id: 1055511498
mas "Display Menu", id: 549083868
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
