## ----------------------------------------
##	Brewfile
## ----------------------------------------
cask_args appdir: "/Applications"

# Base
brew "fd"
brew "jq"
brew "sd"
brew "bat"
brew "exa"
brew "fzf"
brew "ghq"
brew "git"
brew "hub"
brew 'mas'
brew "nkf"
brew "tig"
brew "vim"
brew "grep"
brew "tmux"
brew "mycli"
brew "neovim"
brew "ffmpeg"
brew "git-lfs"
brew "gnu-sed"
brew "ripgrep"
brew "hyperfine"

# Shell
brew "zsh"
brew "zsh-completions"

# Language
brew "go"
brew "gcc"
brew "node", link: true
brew "perl"
brew "ruby"
brew "cmake"
brew "rbenv"
brew "python"
brew "pipenv"
brew "rustup"

# Database
brew "mysql"
brew "redis"
tap  "mongodb/brew"
brew "mongodb-community"

# iTerm2
tap  "homebrew/cask-fonts"
cask "font-source-code-pro"
cask "font-noto-mono-for-powerline"

# GUI Applications
cask "local"
cask "slack"
cask "alfred"
cask "docker"
cask "iterm2"
cask "kindle"
cask "zoomus"
cask "discord"
cask "postman"
cask "transmit"
cask "evernote"
cask "gpg-suite"
cask "rectangle"
cask "appcleaner"
cask "sequel-pro"
cask "google-chrome"
cask "android-studio"
cask "mongodb-compass"
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "adobe-creative-cloud"
mas  "LINE", id: 539883307
mas  "Xcode", id: 497799835
mas  "Gifski", id: 1351639930
