## ----------------------------------------
##	Brewfile
##	- This file may lack of tap.
## ----------------------------------------
cask_args appdir: "/Applications"

# Base
brew "jq"
brew "fzf"
brew "ghq"
brew "git"
brew "hub"
brew "nkf"
brew "tig"
brew "vim"
brew "grep"
brew "tmux"
brew "tree"
brew "neovim"
brew "ffmpeg"
brew "gnu-sed"
brew "ripgrep"

# Shell
brew "zsh"
brew "zsh-completions"
brew "bash-completion"

# Language
brew "go"
brew "gcc"
brew "node"
brew "perl"
brew "ruby"
brew "cmake"
brew "rbenv"
brew "python"

# Database
brew "mysql"
brew "redis"
brew "mongodb-community"

# iTerm2
tap "homebrew/cask-fonts"
cask "font-source-code-pro"

# GUI Applications
cask "zoom"
cask "local"
cask "slack"
cask "alfred"
cask "docker"
cask "kindle"
cask "discord"
cask "postman"
cask "shiftit"
cask "transmit"
cask "evernote"
cask "gpg-suite"
cask "appcleaner"
cask "sequel-pro"
cask "sublime-text"
cask "google-chrome"
cask "android-studio"
cask "mongodb-compass"
cask "visual-studio-code"
cask "google-japanese-ime"
